app/controllers/produtos_controller.rb

INSERT INTO "produtos" ("nome", "descricao", "preco", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", "Presunto"], ["descricao", "Sadia"], ["preco", 29.0], ["created_at", "2024-09-19 23:14:08.010068"], ["updated_at", "2024-09-19 23:14:08.010068"]]
---
  def create
    @produto = Produto.new(produto_params)

    respond_to do |format|
      if @produto.save